docs: synchronize Case Study 02 format
